Repository: pipelinedb/pipelinedb
Catalog: src/interfaces/ecpg/ecpglib/po/*.po
Languages: it

source: empty message text
it: messaggio di testo vuoto

source: no data found on line %d
it: non ci sono dati alla linea %d

source: out of memory on line %d
it: memoria esaurita alla linea %d

source: unsupported type "%s" on line %d
it: tipo "%s" non supportato alla linea %d

source: too many arguments on line %d
it: troppi argomenti alla linea %d

source: too few arguments on line %d
it: numero di argomenti non sufficiente alla linea %d

source: invalid input syntax for type int: "%s", on line %d
it: sintassi in input non valida per il tipo int: "%s", alla linea %d

source: invalid input syntax for type unsigned int: "%s", on line %d
it: sintassi in input non valida per il tipo unsigned int: "%s", alla linea %d

source: invalid input syntax for floating-point type: "%s", on line %d
it: sintassi in input non valida per il tipo floating-point: "%s", alla linea %d

source: invalid syntax for type boolean: "%s", on line %d
it: sintassi in input non valida per il tipo boolean: "%s", alla linea %d

source: could not convert boolean value: size mismatch, on line %d
it: conversione fallita per il valore booleano: dimensione incompatibile, alla linea %d

source: empty query on line %d
it: query vuota alla linea %d

source: null value without indicator on line %d
it: valore nullo senza variabile 'indicatore' alla linea %d

source: variable does not have an array type on line %d
it: la variabile non è di tipo array alla linea %d

source: data read from server is not an array on line %d
it: i dati letti dal server non sono di tipo array alla linea %d

source: inserting an array of variables is not supported on line %d
it: inserire un array di variabili non è supportato alla linea %d

source: connection "%s" does not exist on line %d
it: la connessione "%s" non esiste alla linea %d

source: not connected to connection "%s" on line %d
it: connessione "%s" non attiva alla linea %d

source: invalid statement name "%s" on line %d
it: nome di istruzione non valido "%s" alla linea %d

source: descriptor "%s" not found on line %d
it: il descrittore "%s" non esiste alla linea %d

source: descriptor index out of range on line %d
it: l'indice del descrittore è fuori intervallo alla linea %d

source: unrecognized descriptor item "%s" on line %d
it: elemento del descrittore "%s" non riconosciuto alla linea %d

source: variable does not have a numeric type on line %d
it: la variabile non è di tipo numerico alla linea %d

source: variable does not have a character type on line %d
it: la variabile non è di tipo carattere alla linea %d

source: error in transaction processing on line %d
it: errore nel processare la transazione alla linea %d

source: could not connect to database "%s" on line %d
it: connessione fallita al database "%s" alla linea %d

source: SQL error %d on line %d
it: errore SQL %d alla linea %d

source: the connection to the server was lost
it: la connessione con il server è andata persa

source: SQL error: %s
it: errore SQL: %s
